# generate sushi dict with \n to print in a string line in matplotlib


origin = {0: '牡丹蝦', 1: '玉子', 2: '煙燻櫻桃鴨', 3: '洋蔥鮭魚', 4: '漬鯖魚', 5: '鮪魚', 6: '鮭魚', 7: '花枝', 8: '日本真鱸', 9: '鮭魚腹', 10: '海鱺', 11: '辛醬鮪魚', 12: '海老', 13: '北寄貝', 14: '紅甘', 15: '日本青甘', 61: '甜蝦', 17: '干貝', 18: '日本大腹', 19: '鹽之花炙干貝', 20: '黑松露杏胞菇', 21: '比目魚緣側', 22: '炙合鴨', 23: '炙燒鮭魚', 24: '鹽之花Prime牛小排', 25: '辛味噌Prime牛小排', 26: '炙黑鰈', 27: '香柚焦糖鮭魚', 28: '明太子花枝', 29: '明太子炙鮭魚', 30: '蒜香牛肉', 31: '鹽之花炙海鱺', 32: '明太子海老', 33: '穴子(星鰻)', 34: '鰻魚', 35: '鹽之花炙和牛', 36: '雙拼生魚片', 37: '綜合生魚片', 38: '盛合生魚片', 39: '稻禾壽司', 40: '太捲', 41: '蘆筍手捲', 42: '納豆細捲', 43: '甘瓢細捲', 44: '鐵火捲', 45: '花壽司', 46: '鮪魚蔥花捲', 47: '龍蝦沙拉手捲', 48: '黃金蟹肉手捲', 49: '蘆筍蝦手捲', 50: '鮭魚子手捲', 51: '味噌湯', 52: '牡丹蝦味噌湯', 53: '海膽', 54: '玉米', 55: '海老子', 56: '韓風螺片', 57: '龍蝦沙拉', 58: '芥末章魚', 59: ' 鮪魚蔥花', 60: '黃金蟹肉', 62: '鮭魚子', 63: '明太子玉子燒', 64: '明太子花枝小物'}

new = {}



for i, j in origin.items():
    name = []

    
    # new[i] = "\n".join(list[j])
    # print(j.split(""))
    for k in j:
        name.append(k)
    
    new[i] = "\n".join(name)

print(new)